---
kind: type
id: T:Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
source: html/6faac766-fc06-f872-22e8-ca3c94b40389.htm
---
# Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution

This class encapsulates a photometric web light distribution.

## Syntax (C#)
```csharp
public class PhotometricWebLightDistribution : LightDistribution
```